ОперативныеЗадачиПоМетодичке/src/Documents/РКО/РКО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РКО</name>
  <registerRecords>AccumulationRegister.Задолженности</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

ОперативныеЗадачиПоМетодичке/src/AccumulationRegisters/Задолженности/Задолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Задолженности</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ОперативныеЗадачиПоМетодичке/src/Documents/РКО/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)


	Движения.Задолженности.Записывать = Истина;
    Движение = Движения.Задолженности.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Контрагент = Контрагент;
    Движение.Сумма = Сумма;


КонецПроцедуры
